$(function() {

	/**
	 * 功能说明：轮播下方导航栏开始
	 * ==========================================================================================
	 */
	// 开始初始化
	$('.box').slick({
		lazyLoad: 'ondemand',
		slidesToShow: 5,
		slidesToScroll: 1
	});
	// 上一个商品
	$(".slick-prev").click(function() {
		$("#image").attr("src", $(".slick-current img").attr("big-image-url"));
	});
	// 下一个商品
	$(".slick-next").click(function() {
		$("#image").attr("src", $(".slick-current img").attr("big-image-url"));
	});
	/**
	 * 功能说明：轮播下方导航栏结束
	 * ==========================================================================================
	 */

	/**
	 * 功能说明：轮播下方导航栏单击事件结束
	 * ==========================================================================================
	 */
	$(".box div img").each(function() {
		$(this).click(function() {
			$("#image").attr("src", $(this).attr("big-image-url"));
		});
	});
	/**
	 * 功能说明：轮播下方导航栏单击事件结束
	 * ==========================================================================================
	 */

	/**
	 * 功能说明：商品详情开始
	 * ==========================================================================================
	 */
	$(".tab-nav>div>ul>li>a").each(function(index) {
		$(this).click(function() {
			/*清除所有导航样式*/
			$(".tab-nav>div>ul>li>a").each(function() {
				$(this).removeClass("active");
			});
			/*为当前项目添加样式*/
			$(this).addClass("active");
			/*隐藏所有内容区域*/
			$(".tab-subnav>div>ul>li").each(function() {
				$(this).hide();
			});
			/*显示当前内容区域*/
			$(".tab-subnav>div>ul>li").eq($(this).attr("index")).show();
		});
	});
	/**
	 * 功能说明：商品详情结束
	 * ==========================================================================================
	 */

	/**
	 * 功能说明：页面图片懒加载开始
	 * ==========================================================================================
	 */
	$(".tab-subnav img").lazyload({
		effect: "fadeIn",
		skip_invisible: false,
		failure_limit: 20
	});
	/**
	 * 功能说明：页面图片懒加载结束
	 * ==========================================================================================
	 */

	/**
	 * 功能说明：吸附式导航栏开始
	 * ==========================================================================================
	 */
	$(window).scroll(function() {
		//获取滚动条高度
		var top_value = $(document).scrollTop();

		//开始取消吸附式
		if(top_value <= 1080) {
			$(".tab-nav").css({
				"position": "relative"
			});

			$(".tocart").hide();
		}

		//开始进行吸附式
		if(top_value > 1080) {
			$(".tab-nav").css({
				"position": "fixed",
				"top": "0"
			});

			$(".tocart").show();
		}
	})
	/**
	 * 功能说明：吸附式导航栏结束
	 * ==========================================================================================
	 */

});